Revit 2026 API

# DatumPlaneFailures Properties

---

The BuiltInFailuresDatumPlaneFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ScopeBoxWrongPosition | The Highlighted Datum cannot be associated with the specified Scope Box because the Datum plane does not intersect the Scope Box. |

#### Reference

BuiltInFailuresDatumPlaneFailures Class

Autodesk.Revit.DB Namespace